Repository: summoner001/gnome-openweather
Catalog: po/*.po
Languages: hu

source: Not available
hu: Nem elérhető

source: My Location
hu: Saját helyszínek

source: Failed to initialize.
hu: Nem sikerült előkészíteni.

source: %s does not work without an api-key. Either set the switch to use the extensions default key in the preferences dialog to on or register at %s and paste your personal key into the preferences dialog.
hu: A(z) %s nem működik API-kulcs nélkül. Vagy a kiterjesztés beépített API-kulcsának használatát kapcsolja be a beállításokban, vagy regisztráljon egyet a(z) %s oldalon és másolja be a személyes kulcsát.

source: OpenWeather Refined: Imported settings from old extension.
hu: OpenWeather Refined: Importált beállítások a régi kiterjesztésből.

source: Can not connect to %s
hu: Nem lehet kapcsolódni a következőhöz: %s

source: Locations
hu: Helyszínek

source: Reload Weather Information
hu: Meteorológiai információk újratöltése

source: See Online
hu: Megtekintés online

source: Weather Settings
hu: Meteorológiai beállítások

source: Manual refreshes less than 2 minutes apart are ignored!
hu: A 2 percnél gyakoribb kézi frissítések nincsenek figyelembe véve!

source: Cannot open %s
hu: Nem lehet megnyitni a következőt: %s

source: Calm
hu: Szélcsend

source: Light air
hu: Enyhe légmozgás

source: Light breeze
hu: Könnyű szellő

source: Gentle breeze
hu: Gyenge szél

source: Moderate breeze
hu: Mérsékelt szél

source: Fresh breeze
hu: Élénk szél

source: Strong breeze
hu: Erős szél

source: Moderate gale
hu: Metsző szél

source: Fresh gale
hu: Viharos szél

source: Strong gale
hu: Heves szél

source: Storm
hu: Vihar

source: Violent storm
hu: Heves vihar

source: Hurricane
hu: Orkán

source: Sunday
hu: Vasárnap

source: Monday
hu: Hétfő

source: Tuesday
hu: Kedd

source: Wednesday
hu: Szerda

source: Thursday
hu: Csütörtök

source: Friday
hu: Péntek

source: Saturday
hu: Szombat

source: N
hu: É

source: NE
hu: ÉK

source: E
hu: K

source: SE
hu: DK

source: S
hu: D

source: SW
hu: DNY

source: W
hu: NY

source: NW
hu: ÉNY

source: ft/s
hu: láb/s

source: Loading ...
hu: Betöltés…

source: Please wait
hu: Kis türelmet

source: Feels Like:
hu: Hőérzet:

source: Humidity:
hu: Páratartalom:

source: Pressure:
hu: Légnyomás:

source: Wind:
hu: Szélerősség:

source: Gusts
hu: Széllökés

source: Tomorrow's Forecast
hu: Holnapi előrejelzés

source: %s Day Forecast
hu: %s napi előrejelzés

source: Tomorrow
hu: Holnap

source: %s Multilingual Support
hu: A(z) %s többnyelvű támogatása

source: Use a personal API key for %s
hu: Személyes API-kulcs használata a következőhöz: %s

source: Enable this if you have your own API key from %s and enter it below.
hu: Engedélyezze ezt, ha van saját %s API-kulcsa, majd írja be a kulcsot a következő mezőbe.

source: Settings
hu: Beállítások

source: General
hu: Általános

source: Current Weather Refresh
hu: Jelenlegi időjárás frissítése

source: Current weather refresh interval in minutes
hu: Jelenlegi időjárás frissítési időköze percben kifejezve

source: Weather Forecast Refresh
hu: Időjárás-előrejelzés frissítése

source: Forecast refresh interval in minutes if enabled
hu: Előrejelzés frissítési időköze percben kifejezve

source: My Location Refresh
hu: Saját helyszínek frissítése

source: My location refresh interval in minutes
hu: Jelenlegi időjárás frissítési időköze percben kifejezve

source: Disable Forecast
hu: Előrejelzés letiltása

source: Disables all fetching and processing of forecast data
hu: Előrejelzési adatok letöltésének és feldolgozásának a letiltása

source: System Icons
hu: Rendszerikonok

source: Disable to use packaged %s weather icons
hu: Tiltsa le a(z) %s ikonok használatához

source: If you have issues with your system icons displaying correctly disable this to fix it
hu: Ha problémái vannak a rendszer ikonjainak helyes megjelenítésével, akkor ezt kapcsolja ki a javításához

source: First Boot Delay
hu: Késleltetés első indításkor

source: Seconds to delay popup initialization and data fetching
hu: Felugró ablak betöltésének és az adatok letöltésének késleltetése másodpercben kifejezve

source: This setting only applies to the first time the extension is loaded. (first log in / restarting gnome shell)
hu: Ez a beállítás csak a kiterjesztés legelső indítására vonatkozik. (első bejelentkezés / Gnome Shell újraindítása)

source: Units
hu: Mértékegységek

source: Temperature
hu: Hőmérséklet

source: Wind Speed
hu: Szélsebesség

source: Pressure
hu: Légnyomás

source: 24-hour
hu: 24 órás

source: AM / PM
hu: 12 órás

source: System
hu: Rendszer

source: Time Format
hu: Időformátum

source: Simplify Degrees
hu: Fokok egyszerűsítése

source: Show "°" instead of "°C," "°F," etc.
hu: Csak a „°” megjelenítése a „°C”, „°F”, stb. helyett.

source: Enable this to cut off the "C," "F," etc. from degrees labels.
hu: Engedélyezze ezt a funkciót, hogy a „C”, „F” stb. mértékegységeket levágja a fokszimbólum után.

source: Provider
hu: Szolgáltató

source: Weather Provider
hu: Meteorológiai adatszolgáltató

source: Provider used for weather and forecasts
hu: Szolgáltató az időjáráshoz és az előrejelzésekhez

source: Using provider translations applies to weather conditions only
hu: A szolgáltatói fordítások használata csak az időjárási körülményekre vonatkoznak

source: Enable this to use provider multilingual support if there's no built-in translations for your language yet.
hu: Ha még nincs beépített fordítás az Ön nyelvére, engedélyezze ezt a szolgáltató többnyelvű támogatásának használatához.

source: Use Custom API Key
hu: Egyéni API-kulcs használata

source: Personal API Key
hu: Személyes API-kulcs

source: Reset
hu: Visszaállítás

source: Restore Defaults
hu: Visszaállítás alapértelmezettre

source: Restore all settings to the defaults.
hu: Az összes beállítás visszaállítása alapértelmezettre.

source: Layout
hu: Elrendezés

source: Center
hu: Középen

source: Right
hu: Jobbra

source: Left
hu: Balra

source: Position In Panel
hu: Elhelyezkedés a panelen

source: Position Offset
hu: Elhelyezkedés eltolása

source: The position relative to other items in the box
hu: A dobozban lévő többi elemhez viszonyított elhelyezkedés

source: Show the temperature in the panel
hu: Hőmérséklet megjelenítése a panelen

source: Temperature In Panel
hu: Hőmérséklet a panelen

source: Show the weather conditions in the panel
hu: Az időjárási körülmények megjelenítése a panelen

source: Conditions In Panel
hu: Időjárási körülmények a panelen

source: Show the time of sunrise/sunset in the panel.
hu: A napkelte/napnyugta időpontjának megjelenítése a panelen.

source: Sunrise/Sunset In Panel
hu: Napkelte/napnyugta a panelen

source: Show the sunset/sunrise before the temperature/conditions. Requires restart.
hu: Napkelte/napnyugta megjelenítése a hőmérséklet/időjárási körülmények előtt. Újraindítást igényel.

source: Sunrise/Sunset First (Restart Required)
hu: Napkelte/napnyugta elől

source: Popup
hu: Felugró ablak

source: Popup Position
hu: Felugró ablak elhelyezkedése

source: Alignment of the popup from left to right
hu: Felugró ablak illeszkedése balról jobbra

source: Wind Direction Arrows
hu: Szélirány nyilakkal

source: Translate Conditions
hu: Időjárási körülmények fordítása

source: Temperature Decimal Places
hu: Hőmérséklet tizedesjegyeinek száma

source: Maximum number of digits after the decimal point
hu: Tizedespont után álló számjegyek maximális száma

source: Unit Default
hu: Alapértelmezett mértékegység

source: Follow Temp.
hu: Hőmérséklet követése

source: Pressure Decimal Places
hu: Légnyomás tizedesjegyeinek száma

source: Speed Decimal Places
hu: Szélsebesség tizedesjegyeinek száma

source: Location Text Length
hu: Helyszín szövegének hossza

source: Maximum length of the location text. A setting of '0' is unlimited
hu: Helyszín szövegének maximális hossza. 0-ra állítva korlátlan

source: Off
hu: Ki

source: White Text
hu: Fehér szöveg

source: Black Text
hu: Fekete szöveg

source: High Contrast
hu: Nagy kontraszt

source: Enable to override GNOME shell colors
hu: Engedélyezés a GNOME Shell felülbírálásához

source: Forecast
hu: Előrejelzés

source: Center Today's Forecast
hu: Mai előrejelzés középen

source: Conditions In Forecast
hu: Időjárási körülmények az előrejelzésben

source: Today Only
hu: Csak mai

source: Total Days In Forecast
hu: Napok száma az előrejelzésben

source: Keep Forecast Expanded
hu: Előrejelzés kibontva tartása

source: Search Results from %s
hu: Keresési eredmények innen: %s

source: New Search
hu: Új keresés

source: Searching ...
hu: Keresés…

source: Please wait while searching for locations matching "%s"
hu: Várjon, amíg a következőnek megfelelő helyeket keresi: „%s”

source: AppKey Required
hu: AppKey szükséges

source: You need an AppKey to use MapQuest, get one at: %s
hu: AppKey szükséges a MapQuest használatához, szerezzen be egyet itt: %s

source: Results for "%s"
hu: Eredmények a következő keresésre: „%s”

source: %s has been added
hu: %s hozzáadva

source: API Error
hu: API-hiba

source: Invalid data when searching for "%s".
hu: Érvénytelen adat a(z) „%s” keresésekor.

source: No Matches Found
hu: Nincs megfelelő találat

source: No results found when searching for "%s".
hu: Nincs megfelelő találat a következőre: „%s”.

source: About
hu: Névjegy

source: Display weather information for any location on Earth in the GNOME Shell.
hu: Időjárási információk megjelenítése a Föld bármely pontján a GNOME Shellben.

source: Unknown
hu: Ismeretlen

source: OpenWeather Refined Version
hu: OpenWeather Refined verziója

source: Git Version
hu: Git verziója

source: GNOME Version
hu: Gnome verziója

source: Copy Settings JSON
hu: Settings JSON másolása

source: Copy
hu: Másolás

source: Copied settings JSON to clipboard.
hu: A settings JSON a vágólapra lett másolva.

source: Maintained by: %s
hu: Karbantartó: %s

source: Contribute or translate the project on %s.
hu: Működjön közre vagy segítsen lefordítani a projektet itt: %s.

source: This is a fork of %s's extension.
hu: Ez egy elágaztatása a(z) %s kiterjesztésnek.

source: Weather data provided by: %s
hu: Meteorológiai adatok forrása: %s

source: This program comes with ABSOLUTELY NO WARRANTY.
hu: Ez a program mindenféle GARANCIAVÁLLALÁS NÉLKÜL kerül kiadásra.

source: See the
hu: Tekintse meg a

source: GNU General Public License, version 2 or later
hu: GNU General Public License, 2. verzió vagy újabbat

source: for details.
hu: a részletekért.

source: Add
hu: Hozzáadás

source: My Loc. Provider
hu: Saját helyszín szolgáltatója

source: Provider for getting My Location
hu: Szolgáltató a helyszín kereséséhez

source: Geolocation Provider
hu: Helymeghatározás szolgáltatója

source: Provider used for location search
hu: A helykereséshez használt szolgáltató

source: Personal MapQuest Key
hu: Személyes MapQuest-kulcs

source: Personal API Key from developer.mapquest.com
hu: Személyes API-kulcs innen: developer.mapquest.com

source: Location changed to: %s
hu: A helyszín a következőre változott: %s

source: Add New Location
hu: Új helyszín hozzáadása

source: Search by Location or Coordinates
hu: Keresés helyszín vagy koordináták alapján

source: e.g. London, England or 51.5074456,-0.1277653
hu: például: London, Anglia vagy 51.5074456,-0.1277653

source: Clear entry
hu: Bejegyzés törlése

source: Search
hu: Keresés

source: We need something to search for!
hu: Keresőkifejezés szükséges!

source: Edit %s
hu: %s szerkesztése

source: Edit Name
hu: Név szerkesztése

source: Edit Coordinates
hu: Koordináták szerkesztése

source: If you meant to search up a new location by name, <b>add</b> a location instead.
hu: Ha egy új helyszínt akart keresni a neve alapján, akkor helyette <b>adjon hozzá</b> egy helyszínt.

source: Save
hu: Mentés

source: Coordinates field cannot be empty.
hu: A koordináták mező nem lehet üres.

source: Coordinates field must be in the format of '%s' or the text '%s'.
hu: A koordináták mezőnek a(z) „%s” vagy a(z) „%s” formátumú szövegnek kell lennie.

source: Name field can only be empty if coordinates are '%s'.
hu: A névmező csak akkor lehet üres, ha a koordináták a következők: „%s”.

source: %s has been updated
hu: %s frissítve lett

source: Are you sure you want to delete "%s"?
hu: Biztosan törli a következőt: „%s”?

source: Delete
hu: Törlés

source: Cancel
hu: Mégse

source: %s has been deleted
hu: %s törölve

source: Temperature Unit
hu: Hőmérséklet mértékegysége

source: Pressure Unit
hu: Légnyomás mértékegysége

source: Wind Speed Units
hu: Szélerősség mértékegysége

source: Choose the units used for wind speed. Allowed values are 'kph', 'mph', 'm/s', 'knots', 'ft/s' or 'Beaufort'.
hu: Válassza ki a szélsebesség mértékegységét. A rendelkezésre álló mértékegységek: „km/h”, „mph”, „m/s”, „csomó”, „láb/s” vagy „Beaufort”.

source: Wind Direction by Arrows
hu: Szélirány nyilakkal

source: True to display wind direction through arrows rather than letters.
hu: Szélirány nyilakkal való kijelzése szöveg helyett.

source: DEPRECATED, City to be displayed
hu: Megjelenítendő város (Elavult)

source: Index of the city to display by default.
hu: Az alapértelmezés szerint megjelenítendő város indexe.

source: OpenWeatherMap Multilingual Support (weather descriptions only)
hu: OpenWeatherMap többnyelvű támogatás (csak az időjárás leírása)

source: True to show temperature in the panel
hu: Hőmérséklet megjelenítés a panelen

source: True to show conditions in the panel.
hu: Időjárási körülmények megjelenítése a panelen.

source: Conditions in Forecast
hu: Időjárási körülmények az előrejelzésben

source: Position in Panel
hu: Elhelyezkedés a panelen

source: Horizontal position of menu-box.
hu: A menüdoboz vízszintes elhelyezkedése.

source: Refresh interval (actual weather)
hu: Frissítési gyakoriság (jelenlegi időjárás)

source: Maximum length of the location text
hu: Helyszín szövegének maximális hossza

source: Refresh interval (forecast)
hu: Frissítési gyakoriság (előrejelzés)

source: Center forecastbox.
hu: Előrejelzési doboz középre igazítása.

source: Always keep forecast expanded
hu: Előrejelzés mindig kibontva marad

source: Number of days in forecast
hu: Előre jelzett napok száma

source: Maximum number of digits after the decimal point for temperature
hu: Tizedespont után álló számjegyek maximális száma a hőmérséklethez

source: Maximum number of digits after the decimal point for pressure
hu: Tizedespont után álló számjegyek maximális száma a légnyomáshoz

source: Maximum number of digits after the decimal point for wind speed
hu: Tizedespont után álló számjegyek maximális száma a szélsebességhez

source: Your personal API key from openweathermap.org
hu: Az Ön személyes API-kulcsa innen: openweathermap.org

source: Your personal API key from WeatherAPI.com
hu: Az Ön személyes API-kulcsa innen: WeatherAPI.com

source: Use the extensions default API key from openweathermap.org
hu: A kiterjesztés alapértelmezett API-kulcsának használata innen: openweathermap.org

source: Use the extensions default API key from WeatherAPI.com
hu: A kiterjesztés alapértelmezett API-kulcsának használata innen: WeatherAPI.com

source: Your personal AppKey from developer.mapquest.com
hu: Az Ön személyes API-kulcsa innen: developer.mapquest.com

source: Time format for hours. Possible values are '24hr' for 24-hour clock, '12hr' for AM/PM, and 'system' to follow the GNOME setting.
hu: Az óra időformátuma. A lehetséges értékek: „24 órás” a 24 órás formátum; a „12 órás” az AM/PM, és a „Rendszer” a GNOME beállításainak követéséhez.

source: Seconds to delay popup initialization and data fetch on the first load
hu: Felugró ablak betöltésének és az adatok letöltésének késleltetése az első betöltéskor, másodpercben kifejezve

source: Default width for the preferences window
hu: Beállítások ablakának alapértelmezett szélessége

source: Default height for the preferences window
hu: Beállítások ablakának alapértelmezett magassága

source: High contrast style to use, possible values are 'none', 'white', or 'black'.
hu: Nagy kontrasztú stílus, a lehetséges értékek: „nincs”, „fehér” vagy „fekete”.

source: True to show the sunset/sunrise in the panel.
hu: Napkelte/napnyugta megjelenítése a panelen.

source: True to show the sunset/sunrise in the panel before the temperature/conditions if enabled.
hu: Napkelte/napnyugta megjelenítése a panelen a hőmérséklet/időjárási körülmények előtt.

source: False if this extension has never been initialized before.
hu: Hamis, ha ez a kiterjesztés még soha nem volt előkészítve.

source: How often, in minutes, to re-fetch My Location if selected.
hu: Gyakoriság, percben kifejezve, újra le kell kérni a „Saját helyszíneket”, ha be van jelölve.

source: True to cut off the "F" or "C" after the degree symbol.
hu: Az „F” és „C” mértékegység levágása a fokszimbólum után.

source: Freezes the settings changed listener; user should not change this.
hu: Lefagy a beállítások megváltoztatásának figyelője; a felhasználónak nem szabad ezt megváltoztatnia.

source: List of locations.
hu: Helyszínek listája.

source: Provider to use for "My Location."
hu: Szolgáltató a „Saját helyszínekhez”

source: Empty or the last initialization error message.
hu: Üres vagy az utolsó előkészítési hibaüzenet.
